test.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:add xmlns:ns2="http://www.openiam.org/service/connector" xmlns:ns3="http://www.openiam.org/service/types"
                 xmlns:ns4="urn:idm.openiam.org/srvc/continfo/dto" xmlns:ns5="urn:idm.openiam.org/srvc/role/dto"
                 xmlns:ns6="urn:idm.openiam.org/srvc/grp/dto">
            <reqType>
                <requestID>Rc4d23d0b3a3a4f88afea92d3ffdf249f</requestID>
                <targetID>8a70a63f3f079e58013f0e9e89760052</targetID>
                <hostUrl>23.21.229.176</hostUrl>
                <hostLoginId>administrator</hostLoginId>
                <hostLoginPassword>=tdWk2eqV8P</hostLoginPassword>
                <baseDN>cn=Users,dc=ad,dc=openiamdemo,dc=info</baseDN>
                <userIdentity>sAMAccountName=VY1_F1.VY1_L1,cn=Users,dc=ad,dc=openiamdemo,dc=info</userIdentity>
                <operation>ADD</operation>
                <user>
                    <ns3:operation>0</ns3:operation>
                    <ns3:attributes>
                        <ns3:name>Surname</ns3:name>
                        <ns3:value>VlkxX0wx</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>GivenName</ns3:name>
                        <ns3:value>VlkxX0Yx</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>DisplayName</ns3:name>
                        <ns3:value>VlkxX0wxLFZZMV9GMQ==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>HomeDirectory</ns3:name>
                        <ns3:value>XFxkZXZzZXJ2ZXJcU1lTVk9MXGlkbWRldi5sb2NhbA==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>Path</ns3:name>
                        <ns3:value>Y249VXNlcnMsZGM9YWQsZGM9b3BlbmlhbWRlbW8sZGM9aW5mbw==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>ProfilePath</ns3:name>
                        <ns3:value>Yzo=</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>HomeDrive</ns3:name>
                        <ns3:value>SDo=</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>ScriptPath</ns3:name>
                        <ns3:value>bmV0eHAuY21k</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>Company</ns3:name>
                        <ns3:value>T3BlbklBTQ==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>UserPrincipalName</ns3:name>
                        <ns3:value>VlkxX0YxLlZZMV9MMUBhZC5vcGVuaWFtZGVtby5pbmZv</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>StreetAddress</ns3:name>
                        <ns3:value>VlkxX0YxLlZZMV9MMUBhZC5vcGVuaWFtZGVtby5pbmZv</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>City</ns3:name>
                        <ns3:value>VlkxX0YxLlZZMV9MMUBhZC5vcGVuaWFtZGVtby5pbmZv</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>State</ns3:name>
                        <ns3:value>VlkxX0YxLlZZMV9MMUBhZC5vcGVuaWFtZGVtby5pbmZv</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>PostalCode</ns3:name>
                        <ns3:value>VlkxX0YxLlZZMV9MMUBhZC5vcGVuaWFtZGVtby5pbmZv</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>Name</ns3:name>
                        <ns3:value>VlkxX0YxIFZZMV9MMQ==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>AccountPassword</ns3:name>
                        <ns3:value>UGFzc3dvcmQkNTE=</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:attributes>
                        <ns3:name>Office</ns3:name>
                        <ns3:value>T3BlbklBTQ==</ns3:value>
                        <ns3:operation>1</ns3:operation>
                        <ns3:multivalued>false</ns3:multivalued>
                        <ns3:dataType>STRING</ns3:dataType>
                    </ns3:attributes>
                    <ns3:principalFieldName>samAccountName</ns3:principalFieldName>
                    <ns3:principalFieldDataType>STRING</ns3:principalFieldDataType>
                </user>
                <scriptHandler>ADPowershell.ps1</scriptHandler>
            </reqType>
        </ns2:add>
    </soap:Body>
</soap:Envelope>